function [ error_xyz  ] = caculate_error_m( input_args )%#codegen
%UNTITLED2 此处显示有关此函数的摘要
%   此处显示详细说明

syms x1 y1 z1;
syms x2 y2 z2;
syms x3 y3 z3;
syms x4 y4 z4;



x =[ -(2*x1 - 2*x4)/(2*((x1 - x4)^2 + (y1 - y4)^2 + (z1 - z4)^2)^(1/2)), -(2*y1 - 2*y4)/(2*((x1 - x4)^2 + (y1 - y4)^2 + (z1 - z4)^2)^(1/2)), -(2*z1 - 2*z4)/(2*((x1 - x4)^2 + (y1 - y4)^2 + (z1 - z4)^2)^(1/2));
     -(2*x2 - 2*x4)/(2*((x2 - x4)^2 + (y2 - y4)^2 + (z2 - z4)^2)^(1/2)), -(2*y2 - 2*y4)/(2*((x2 - x4)^2 + (y2 - y4)^2 + (z2 - z4)^2)^(1/2)), -(2*z2 - 2*z4)/(2*((x2 - x4)^2 + (y2 - y4)^2 + (z2 - z4)^2)^(1/2));
     -(2*x3 - 2*x4)/(2*((x3 - x4)^2 + (y3 - y4)^2 + (z3 - z4)^2)^(1/2)), -(2*y3 - 2*y4)/(2*((x3 - x4)^2 + (y3 - y4)^2 + (z3 - z4)^2)^(1/2)), -(2*z3 - 2*z4)/(2*((x3 - x4)^2 + (y3 - y4)^2 + (z3 - z4)^2)^(1/2))];

X=subs(x,[x1,y1,z1;x2,y2,z2;x3,y3,z3;x4,y4,z4],input_args);

error_xyz=sum(inv(X).*inv(X),2);

end

